# yolov8n_bdd.yaml
# YOLOv8n 모델 구성 (8.3.127 이상 호환)
# 복사본이며 클래스 수만 수정

nc: 10  # ← BDD100k 클래스 수에 맞게 수정

depth_multiple: 0.33
width_multiple: 0.25

backbone:
  [[-1, 1, Conv, [64, 3, 2]],
   [-1, 1, Conv, [128, 3, 2]],
   [-1, 3, C2f, [128]],
   [-1, 1, Conv, [256, 3, 2]],
   [-1, 6, C2f, [256]],
   [-1, 1, Conv, [512, 3, 2]],
   [-1, 6, C2f, [512]],
   [-1, 1, Conv, [1024, 3, 2]],
   [-1, 3, C2f, [1024]],
   [-1, 1, SPPF, [1024, 5]]]

head:
  [[-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],
   [-1, 3, C2f, [512]],
   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],
   [-1, 3, C2f, [256]],
   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 14], 1, Concat, [1]],
   [-1, 3, C2f, [512]],
   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 10], 1, Concat, [1]],
   [-1, 3, C2f, [1024]],
   [[17, 20, 23], 1, Detect, [nc]]]
